'''
字面量：在代码中，被写下来的固定的值，称为字面量
常用的值类型
Python 中常用的有 6 种值（数据）的类型
整数(int)，如：10、-10
浮点数(float)，如：13.14、-13.14
复数(complex)，如：4+3j，以 j 结尾表示复数
布尔(bool)，表达现实生活中的逻辑，即真和假，True 表示真，False 表示假。True 本质上是一个数字记作 1，False 记作 0
字符串(string)，描述文本的一种数据类型，由任意数量的字符组成，程序中需要加上引号来表示字符串
列表(List)，有序的可变序列，Python 中使用最频繁的数据类型，可有序记录一堆数据
元组(Tuple)，有序的不可变序列，可有序记录一堆不可变的 Python 数据集合
集合(Set)，无序不重复集合，可无序记录一堆不重复的 Python 数据集合
字典(Dictionary)，无序 Key-Value 集合，可无序记录一堆 Key-Value 型的 Python 数据集合
'''

print("Hello word!!!")#打印显示括号中的内容


#总结
'''
1. 掌握字面量的含义  
   代码中，被写在代码中的固定的值，称之为字面量。

2. 常见的字面量类型  
   我们目前了解：整数、浮点数、字符串这三类即可。

3. 如何基于 print 语句完成各类字面量的输出  
   print(字面量)，如：  
   - print(10)，输出整数 10  
   - print(13.14)，输出浮点数 13.14  
   - print("黑马程序员")，输出字符串：黑马程序员
'''