'''
注释：在程序代码中对程序代码进行解释说明的文字。
作用：注释不是程序，不能被执行，只是对程序代码进行解释说明，让别人可以看懂程序代码的作用，能够大大增强程序的可读性。
'''
#单行注释：以 # 开头，# 右边的所有文字当作说明，而不是真正要执行的程序，起辅助说明作用。
# 我是单行注释
print("Hello World")
#注意：# 号和注释内容一般建议以一个空格隔开。
'''多行注释：用一对三个双引号（"""注释内容"""）将说明文字包起来，用来解释一段代码的作用或使用方式。'''



#总结
'''提取并整理后的文字如下：

1. 注释的作用是？  
   注释是代码中的解释型语句，用来对代码内容进行注解。  
   注释不是代码，不会被程序执行。

2. 单行注释如何定义？  
   通过 `#` 号定义，在 `#` 号右侧的所有内容均作为注释。  
   建议在 `#` 号和注释内容之间，间隔一个空格。  
   单行注释一般用于对一行或一小部分代码进行解释。

3. 多行注释如何定义？  
   通过一对三个引号来定义（`"""注释内容"""`），引号内部均是注释，可以换行。  
   多行注释一般用于对 Python 文件、类或方法进行解释。'''