# 算术（数学）运算符
#
# 运算符 | 描述 | 实例
# + | 加 | 两个对象相加 a + b 输出结果 30
# - | 减 | 得到负数或是一个数减去另一个数 a - b 输出结果 -10
# * | 乘 | 两个数相乘或是返回一个被重复若干次的字符串 a * b 输出结果 200
# / | 除 | b / a 输出结果 2
# // | 取整除 | 返回商的整数部分 9 // 2 输出结果 4，9.0 // 2.0 输出结果 4.0
# % | 取余 | 返回除法的余数 b % a 输出结果 0
# ** | 指数 | a**b 为 10 的 20 次方，输出结果 100000000000000000000

print("5 + 2 =", 5 + 2)      # 应用加法
print("5 - 2 =", 5 - 2)      # 应用减法
print("5 * 2 =", 5 * 2)      # 应用乘法
print("5 / 2 =", 5 / 2)      # 应用除法，非整除 (除法自动变成float)
print("5 // 2 =", 5 // 2)    # 应用整除
print("5 % 2 =", 5 % 2)      # 应用取余 (取余自动变成float)
print("5 ** 2 =", 5 ** 2)    # 应用指数计算


# **赋值运算符**
#
# | 运算符 | 描述     | 实例                                      |
# | ------ | -------- | ----------------------------------------- |
# | =      | 赋值运算符 | 把 = 号右边的结果 赋给 左边的变量，如 num = 1 + 2 * 3，结果 num 的值为 7 |
#
# **复合赋值运算符**
#
# | 运算符 | 描述         | 实例                                      |
# | ------ | ------------ | ----------------------------------------- |
# | +=     | 加法赋值运算符 | c += a 等效于 c = c + a                    |
# | -=     | 减法赋值运算符 | c -= a 等效于 c = c - a                    |
# | *=     | 乘法赋值运算符 | c *= a 等效于 c = c * a                    |
# | /=     | 除法赋值运算符 | c /= a 等效于 c = c / a                    |
# | %=     | 取模赋值运算符 | c %= a 等效于 c = c % a                    |
# | **=    | 幂赋值运算符   | c **= a 等效于 c = c ** a                  |
# | //=    | 取整除赋值运算符 | c //= a 等效于 c = c // a                |

# 赋值运算符（=），表示将右侧的结果提供给左侧变量
# 即执行上：先执行右侧得到结果，再赋值给左侧变量
age = 10
age = age + 5

# 复合运算符基础架构：?=
# a ?= b 表示 a = a ? b
# ? 可以是任何的数学运算符，如：+ - * / // **

num = 10
num += 1      # 等于 num = num + 1  → 11
print(num)
num -= 1      # num = num - 1      → 10
print(num)
num *= 2      # num = num * 2      → 20
print(num)
num /= 2      # num = num / 2      → 10.0
print(num)
num //= 2     # num = num // 2     → 5
print(num)
num **= 2     # num = num ** 2     → 25
print(num)
num %= 4     # num = num % 4     → 1
print(num)